---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.LoadareaRecovered
source: html/b03ad822-bba9-cbdc-b856-79871dee0652.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.LoadareaRecovered Property

The boundary encloses the region for area based load:[Areabasedload].

## Syntax (C#)
```csharp
public static FailureDefinitionId LoadareaRecovered { get; }
```